#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//大端就是：把数据的低部分字节储存在高部分字节处，把数据的高部分字节储存在低部分字节处；
//小端就是：把数据的高部分字节储存在低部分字节处，把数据的低部分字节储存在高部分字节处；
//int main()
//{
//	int n = 0x00000001;
//	//大端 00 00 00 01
//	//小端 01 00 00 00
//	//因为是一个字节所以我们可以用char*
//	if (*(char*)&n == 1) printf("小端\n");
//	else printf("大端\n");
//
//	return 0;
//}

////对于signed char 的取值范围是-128~127
////对于unsigned char的取值范围是0~255
////对于char是有无符号数取决与编译器，在vscode上char相当于signed char
//int main()
//{
//	//-1的原码： 10000000 00000000 00000000 00000001
//	//-1的补码： 11111111 11111111 11111111 11111111
//	//因为char一个字节，所以截断了。在vs上用的是小端字节序，所以第一个字节储存的是从右边开始 11111111
//	char a = -1;
//	//a：11111111
//	signed char b = -1;
//	//b:111111111
//	unsigned char c = -1;
//	//c:11111111
//	printf("a=%d b=%d c=%d", a, b, c);
//	//以符号位整形提升 
//		//a：11111111 111111111 1111111111 1111111111 -1
//		//b：11111111 111111111 1111111111 1111111111 -1
//		//c：00000000 000000000 0000000000 1111111111   255
//
//	return 0;
//}

int main()
{
	char a = -128;
	//00000000 00000000 00000000 10000000补码
	//a：10000000
	printf("%u\n", a);
	//整形提升 111111111 111111111 111111111 10000000
	printf("%d\n", a);
	//整形提升 11111111  11111111  111111111 10000000补码
	//原码     10000000  00000000  000000000 10000000
	return 0;
}

int main()
{
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;

	}
	
	printf("%zd", strlen(a));
}